Revit 2018 API
ServerPath Properties
The ServerPath type exposes the following members.
Properties
Name | Description
CentralServerPath
 A path to the location of the central Revit server.
 (Inherited from ModelPath.)
Empty
 Whether this path is empty
 (Inherited from ModelPath.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ModelPath.)
ServerPath
 Whether this path is a server path (as opposed to a file path or cloud path)
 (Inherited from ModelPath.)
See Also
ServerPath Class
Autodesk.Revit.DB Namespace